![title](./pic/accessor/1_title.png)

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('./csv/titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

---

## Native accessors

Native Python-`Objekte` bieten gute Möglichkeiten zur **Indizierung** von Daten. `Pandas` bietet alle diese Möglichkeiten, was den Einstieg in die Software erleichtert.

In Python kann man auf die Eigenschaft eines Objekts zugreifen, indem man sie als Attribut aufruft. Ein `passenger`-Objekt kann zum Beispiel einen `Namen` haben, auf die wir durch den Aufruf von `DataFrame.Name` zugreifen können. Spalten in einem `Pandas` `DataFrame` funktionieren auf ähnliche Weise.

![title](./pic/accessor/2_acc.png)

<video width="1000" controls src="./pic/accessor/3_acc_example.mp4" />

Daher können wir auf die Spalte `Name` von Passagieren in dem `DataFrame` wie folgt zugreifen

In [4]:
df.Name

0                                  Kelly, Mr. James
1                  Wilkes, Mrs. James (Ellen Needs)
2                         Myles, Mr. Thomas Francis
3                                  Wirz, Mr. Albert
4      Hirvonen, Mrs. Alexander (Helga E Lindqvist)
                           ...
413                              Spector, Mr. Woolf
414                    Oliva y Ocana, Dona. Fermina
415                    Saether, Mr. Simon Sivertsen
416                             Ware, Mr. Frederick
417                        Peter, Master. Michael J
Name: Name, Length: 418, dtype: object

<br>

Wenn wir ein Python-`Dictionary` haben, können wir mit dem Indexierungsoperator `[]` auf dessen Werte zugreifen. Das Gleiche gilt für Spalten in einem `DataFrame`:

In [5]:
df['Name']

0                                  Kelly, Mr. James
1                  Wilkes, Mrs. James (Ellen Needs)
2                         Myles, Mr. Thomas Francis
3                                  Wirz, Mr. Albert
4      Hirvonen, Mrs. Alexander (Helga E Lindqvist)
                           ...
413                              Spector, Mr. Woolf
414                    Oliva y Ocana, Dona. Fermina
415                    Saether, Mr. Simon Sivertsen
416                             Ware, Mr. Frederick
417                        Peter, Master. Michael J
Name: Name, Length: 418, dtype: object

Wie du also sehen kannst, können wir uns mit `.spalten_name` oder `["spalten_name"]` eine spezielle `Series` aus dem `DataFrame` ausgeben lassen. Willst du aber z.B. weiterhin mit einem `DataFrame` arbeiten, kannst du die Abfrage in  doppelte Klammern also `[["spalten_name"]]` packen und du wirst ein `DataFrame` und keine `Series` von genau dieser Spalte erhalten.

In [6]:
df[['Name']]

                                             Name
0                                Kelly, Mr. James
1                Wilkes, Mrs. James (Ellen Needs)
2                       Myles, Mr. Thomas Francis
3                                Wirz, Mr. Albert
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)
..                                            ...
413                            Spector, Mr. Woolf
414                  Oliva y Ocana, Dona. Fermina
415                  Saether, Mr. Simon Sivertsen
416                           Ware, Mr. Frederick
417                      Peter, Master. Michael J

[418 rows x 1 columns]

Zudem funktioniert der obige Fall nicht nur mit einer Spalte, sondern auch mit **mehreren Spalten**:

In [9]:
df[['Name', 'Age']]

                                             Name   Age
0                                Kelly, Mr. James  34.5
1                Wilkes, Mrs. James (Ellen Needs)  47.0
2                       Myles, Mr. Thomas Francis  62.0
3                                Wirz, Mr. Albert  27.0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  22.0
..                                            ...   ...
413                            Spector, Mr. Woolf   NaN
414                  Oliva y Ocana, Dona. Fermina  39.0
415                  Saether, Mr. Simon Sivertsen  38.5
416                           Ware, Mr. Frederick   NaN
417                      Peter, Master. Michael J   NaN

[418 rows x 2 columns]

Dies sind die beiden Möglichkeiten, eine bestimmte `Series` (bzw. ein neues `DataFrame`) aus einem `DataFrame` auszuwählen. Keine von beiden ist syntaktisch mehr oder weniger gültig als die andere, aber der Indizierungsoperator `[]` hat den Vorteil, dass er mit Spaltennamen umgehen kann, die reservierte Zeichen enthalten (wenn wir z. B. eine Spalte `Passagier Name` hätten, würde `dataframe.Passagier Name` nicht funktionieren, `dataframe["Passagier Name]` jedoch schon).

Sieht eine Pandas-`Series` nicht aus wie ein schickes `Dictionary`? Das ist es auch, und so überrascht es nicht, dass wir für die Suche nach einem bestimmten Wert nur noch einmal den Indexierungsoperator `[]` verwenden müssen:

In [7]:
df['Name'][0]

'Kelly, Mr. James'

Diesen sehen wir uns doch gleich direkt im nächsten Notebook an.